/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Valor no válido.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "El valor “%@” no es válido.";

/* NSFormattingError */
"Err2048-C" = "Error de formato";

/* NSFileLockingError */
"Err255-C" = "No se ha podido bloquear el archivo";

/* NSFileLockingError */
"Err255-R" = "Es posible que el archivo ya esté bloqueado o que carezca de los privilegios de acceso necesarios para bloquearlo.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "No se ha podido bloquear el archivo “%@”.";

/* NSFileReadUnknownError */
"Err256" = "No se ha podido abrir el archivo.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "No se ha podido abrir el archivo “%@”.";

/* NSFileReadNoPermissionError */
"Err257" = "El archivo no ha podido abrirse porque carece de los privilegios de acceso necesarios.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Carece de los privilegios de acceso necesarios.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Para consultar o modificar los privilegios de acceso, seleccione el ítem en el Finder y elija Archivo > Obtener información.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "El archivo “%@” no ha podido abrirse porque carece de los privilegios de acceso necesarios.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Nombre de archivo no válido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "No se ha podido abrir el ítem porque el nombre del archivo “%@” no es válido. ";

/* NSFileReadCorruptFileError */
"Err259" = "No ha sido posible abrir el archivo porque no tiene el formato correcto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "El archivo no tiene el formato adecuado.";

/* NSFileReadCorruptFileError */
"Err259-R" = "El archivo puede estar corrupto, incompleto o en un formato distinto al que cree.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "No ha sido posible abrir el archivo “%@” porque no tiene el formato correcto.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "El archivo no existe.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "El archivo “%@” no existe.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "No se ha podido abrir el archivo utilizando la codificación de texto especificada.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "La codificación de texto especificada no puede aplicarse.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "La codificación de texto %@ no puede aplicarse.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Es posible que el archivo se haya guardado con una codificación de texto distinta o que no sea un archivo de texto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "No se ha podido abrir el archivo utilizando la codificación de texto %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "No se ha podido abrir el archivo “%2$@” usando la codificación de texto %1$@. ";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "El archivo no ha podido abrirse porque el tipo de URL especificado no es compatible.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "El tipo de URL especificado no es compatible.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "No se ha podido abrir el archivo “%1$@” porque la URL del tipo %2$@ no es admitida.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "El archivo no ha podido abrirse porque el tipo de URL %@ no es compatible.";

/* NSFileReadTooLargeError */
"Err263" = "El archivo no ha podido abrirse porque es demasiado grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "El archivo es demasiado grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "No se ha podido abrir el archivo “%@” porque es demasiado grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "No ha sido posible abrir el archivo porque no se ha podido determinar la codificación de texto del contenido.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "No se ha podido determinar la codificación de texto del contenido.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Puede que sea posible abrir el archivo especificando explícitamente la codificación de texto.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "No ha sido posible abrir el archivo “%@” porque no se ha podido determinar la codificación de texto del contenido.";

/* NSUserCancelledError */
"Err3072-C" = "La operación se ha cancelado.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” no se ha podido eliminar.";

/* NSFileNoSuchFileError */
"Err4-C" = "El archivo no existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "El archivo “%@” no existe.";

/* NSFileWriteUnknownError */
"Err512" = "No se ha podido guardar el archivo.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "No se ha podido copiar “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "No se ha podido enlazar “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "No se ha podido trasladar “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” no se ha podido eliminar.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "No se ha podido guardar el archivo “%2$@” en la carpeta “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "No se ha podido guardar el archivo “%@”.";

/* NSFileWriteNoPermissionError */
"Err513" = "El archivo no ha podido guardarse porque carece de los privilegios de acceso necesarios.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "No se ha podido copiar “%1$@” porque carece de los privilegios de acceso necesarios para “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "No se ha podido enlazar “%1$@” porque carece de los privilegios de acceso necesarios para “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "No se ha podido trasladar “%1$@” porque carece de los privilegios de acceso necesarios para “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "No ha podido eliminarse “%@” porque carece de los privilegios de acceso necesarios.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Carece de los privilegios de acceso necesarios.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Para consultar o modificar los privilegios de acceso, seleccione el ítem en el Finder y elija Archivo > Obtener información.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Carece de los privilegios de acceso necesarios para guardar el archivo “%2$@” en la carpeta “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Carece de los privilegios de acceso necesarios para guardar el archivo “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "No ha sido posible guardar el ítem porque el nombre no es válido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "No se ha podido eliminar el ítem porque el nombre del archivo “%@” no es válido. ";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Nombre de archivo no válido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "No se ha podido guardar el ítem porque el nombre del archivo “%@” no es válido. ";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "No se ha podido guardar el archivo utilizando la codificación de texto especificada.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "La codificación de texto especificada no puede aplicarse.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "La codificación de texto %@ no puede aplicarse.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Si es posible, seleccione otra codificación de texto.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "No se ha podido guardar el archivo utilizando la codificación de texto %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "No se ha podido guardar el archivo “%2$@” usando la codificación de texto %1$@. ";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "El archivo no ha podido guardarse porque el tipo de URL especificado no es compatible.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "El tipo de URL especificado no es compatible.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "No se ha podido guardar el archivo “%1$@” porque la URL del tipo %2$@ no es admitida.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "El archivo no ha podido guardarse porque el tipo de URL %@ no es compatible.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "No ha sido posible guardar el archivo porque no queda suficiente espacio.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "No se ha podido copiar “%1$@” a “%2$@” porque no hay suficiente espacio.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "No se ha podido enlazar “%1$@” a “%2$@” porque no hay suficiente espacio.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "No se ha podido trasladar “%1$@” a “%2$@” porque no hay suficiente espacio.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "No hay suficiente espacio.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "No queda espacio disponible en el volumen “%@”.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Elimine algunos archivos del volumen e inténtelo de nuevo.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "El archivo “%@” no puede guardarse porque no queda suficiente espacio.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "El archivo “%1$@” no puede guardarse porque no queda espacio en el volumen “%2$@”.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "No se ha podido completar la operación. (Error de %1$@ %2$ld).";

